_posts/programming/2023-08-25-cppcoreguidelines-t2.html
---
layout: post
title: CppCoreGuidelines T.2 用模板表达哪种适用于多种数据类型的算法
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Use templates to express algorithms that apply to many argument
types&rdquo;
</p>

<p>
理由
</p>

<p>
通用化。精简代码。互操作。可重用。
</p>


<p>
例子
</p>

<p>
这个原则是 STL 的基础。一个简单的 <code>find</code> 算法，可以适用于多种不同的输入类型。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">template</span><span style="color: #707183;">&lt;</span><span style="color: #7F0055; font-weight: bold;">typename</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span>, <span style="color: #7F0055; font-weight: bold;">typename</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Val</span><span style="color: #707183;">&gt;</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">requires Input_iterator&lt;Iter&gt;</span>
    <span style="color: #3F7F5F;">//       </span><span style="color: #3F7F5F;">&amp;&amp; Equality_comparable&lt;Value_type&lt;Iter&gt;, Val&gt;</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span> <span style="color: #0000ff; font-weight: bold;">find</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span> <span style="color: #000000;">b</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span> <span style="color: #000000;">e</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">Val</span> <span style="color: #000000;">v</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
<span style="color: #707183;">}</span>
</pre>
</div>


<p>
注意
</p>

<p>
只有确实需要适配多种参数类型的时候，才使用模板。不要过度抽象。
</p>
